In [9]:
import sqlalchemy as db
import getpass

In [14]:
user = "root"
password = getpass.getpass("Insert password: ")
connectionURI = f"mysql+pymysql://{user}:{password}@localhost/publications"

Insert password: ········

In [15]:
engine = db.create_engine(connectionURI)
print("Connected to server!")

Connected to server!

In [16]:
import pandas as pd

In [21]:
df = pd.read_sql_query("SELECT au_fname name, au_lname surname FROM authors",engine)
df.head()

       name  surname
0      1234   q23412
1   Johnson    White
2  Marjorie    Green
3    Cheryl   Carson
4   Michael  O'Leary

In [22]:
df.columns

Index(['name', 'surname'], dtype='object')

In [20]:
df["au_fname"]

0            1234
1         Johnson
2        Marjorie
3          Cheryl
4         Michael
5            Dean
6         Meander
7         Abraham
8             Ann
9            Burt
10       Charlene
11    Morningstar
12       Reginald
13          Akiko
14          Innes
15         Michel
16           Dirk
17        Stearns
18          Livia
19         Sylvia
20         Sheryl
21        Heather
22           Anne
23         Albert
Name: au_fname, dtype: object

In [24]:
df = pd.read_sql_query("""
SELECT calc.title, Authors, authors_mean_revenue FROM (
	SELECT 
			t.title,
            t.title_id,
			count(*) TotalAuthors, 
			group_concat(
				concat(au.au_fname, " ", au.au_lname) 
				ORDER BY au.au_fname 
				SEPARATOR " - " 
				) Authors
		FROM titles AS t 
			INNER JOIN titleauthor AS tta
			ON  t.title_id = tta.title_id
			INNER JOIN authors AS au
			ON tta.au_id = au.au_id
		WHERE au.state IN("CA","KS")
		GROUP BY t.title, t.title_id
		ORDER BY Authors
) as calc 
INNER JOIN (
	SELECT 
			titles.title_id, 
			title, 
			concat(round(price*avg(roysched.royalty) / 100,2),"$") AS authors_mean_revenue
		FROM titles 
			INNER JOIN roysched 
			ON roysched.title_id=titles.title_id
			GROUP BY titles.title_id, title, price
) as royals
ON royals.title_id =  calc.title_id
WHERE calc.TotalAuthors >=2
""",engine)
df

,title,Authors,authors_mean_revenue
0,The Busy Executive's Database Guide,Abraham Bennet - Marjorie Green,2.20$
1,"Sushi, Anyone?",Akiko Yokomoto - Burt Gringlesby - Michael O'L...,1.80$
2,Secrets of Silicon Valley,Ann Dull - Sheryl Hunter,2.60$
3,Computer Phobic AND Non-Phobic Individuals: Be...,Livia Karsen - Stearns MacFeather,3.02$
4,Cooking with Computers: Surreptitious Balance ...,Michael O'Leary - Stearns MacFeather,2.03$

In [30]:
df = pd.read_sql_query("""
SELECT sum(qty) FROM sales WHERE title_id IN (
	SELECT titles.title_id FROM authors
		INNER JOIN titleauthor ON authors.au_id=titleauthor.au_id
		INNER JOIN titles ON titles.title_id=titleauthor.title_id
		WHERE state="CA"
		GROUP BY  titles.title_id
    )
""",engine)
df

   sum(qty)
0     250.0

In [34]:
df = pd.read_sql_query("""
    SELECT * from titles
""",engine)
q = df[["title","price"]]
display(q)
q.price.mean()

                                                title  price
0                 The Busy Executive's Database Guide  19.99
1   Cooking with Computers: Surreptitious Balance ...  11.95
2                     You Can Combat Computer Stress!   2.99
3                       Straight Talk About Computers  19.99
4                   Silicon Valley Gastronomic Treats  19.99
5                               The Gourmet Microwave   2.99
6                  The Psychology of Computer Cooking    NaN
7                            But Is It User Friendly?  22.95
8                           Secrets of Silicon Valley  20.00
9                                       Net Etiquette    NaN
10  Computer Phobic AND Non-Phobic Individuals: Be...  21.59
11                                Is Anger the Enemy?  10.95
12                                  Life Without Fear   7.00
13      Prolonged Data Deprivation: Four Case Studies  19.99
14                Emotional Security: A New Algorithm   7.99
15  Onions, Leeks, and Garlic: Cooking Secrets of ...  20.95
16          Fifty Years in Buckingham Palace Kitchens  11.95
17                                     Sushi, Anyone?  14.99

14.76625

# Performance

In [55]:
%%time
pd.read_sql_query("SELECT * FROM employee",engine)["job_id"].sum()

CPU times: user 6.45 ms, sys: 1.36 ms, total: 7.82 ms
Wall time: 12.3 ms

365

In [56]:
%%time
pd.read_sql_query("SELECT sum(job_id) as j FROM employee",engine)["j"][0]

CPU times: user 2.93 ms, sys: 1.29 ms, total: 4.22 ms
Wall time: 36.7 ms

365.0

# Parametrize queries

In [64]:
def getSalesFromType(t):
    df = pd.read_sql_query(f"""
        SELECT Store, ord_num AS OrderNumber, ord_date AS OrderDate, title AS Title, sales.qty AS Qty, price AS Price, type as Type
        FROM (
            SELECT stores.stor_id AS StoreID, stores.stor_name AS Store, COUNT(DISTINCT(ord_num)) AS Orders, COUNT(title_id) AS Items, SUM(qty) AS Qty
            FROM publications.sales sales
            INNER JOIN publications.stores stores ON stores.stor_id = sales.stor_id
            GROUP BY StoreID, Store
        ) summary
        INNER JOIN publications.sales sales ON summary.StoreID = sales.stor_id
        INNER JOIN publications.titles ON sales.title_id = titles.title_id
        WHERE Items / Orders > 1 AND Type="{t}";
        """, engine)
    return df

In [65]:
getSalesFromType("psychology")

,Store,OrderNumber,OrderDate,Title,Qty,Price,Type
0,Doc-U-Mat: Quality Laundry and Books,P3087a,1993-05-29,Computer Phobic AND Non-Phobic Individuals: Be...,20,21.59,psychology
1,News & Brews,D4482,1994-09-14,Is Anger the Enemy?,10,10.95,psychology
2,Doc-U-Mat: Quality Laundry and Books,N914008,1994-09-14,Is Anger the Enemy?,20,10.95,psychology
3,Doc-U-Mat: Quality Laundry and Books,P3087a,1993-05-29,Life Without Fear,25,7.00,psychology
4,Doc-U-Mat: Quality Laundry and Books,P3087a,1993-05-29,Prolonged Data Deprivation: Four Case Studies,15,19.99,psychology
5,Doc-U-Mat: Quality Laundry and Books,P3087a,1993-05-29,Emotional Security: A New Algorithm,25,7.99,psychology

In [66]:
getSalesFromType("trad_cook")

,Store,OrderNumber,OrderDate,Title,Qty,Price,Type
0,News & Brews,P2121,1992-06-15,"Onions, Leeks, and Garlic: Cooking Secrets of ...",40,20.95,trad_cook
1,News & Brews,P2121,1992-06-15,Fifty Years in Buckingham Palace Kitchens,20,11.95,trad_cook
2,News & Brews,P2121,1992-06-15,"Sushi, Anyone?",20,14.99,trad_cook

In [67]:
a = getSalesFromType("psychology")
b = getSalesFromType("trad_cook")

In [68]:
pd.concat([a,b])

,Store,OrderNumber,OrderDate,Title,Qty,Price,Type
0,Doc-U-Mat: Quality Laundry and Books,P3087a,1993-05-29,Computer Phobic AND Non-Phobic Individuals: Be...,20,21.59,psychology
1,News & Brews,D4482,1994-09-14,Is Anger the Enemy?,10,10.95,psychology
2,Doc-U-Mat: Quality Laundry and Books,N914008,1994-09-14,Is Anger the Enemy?,20,10.95,psychology
3,Doc-U-Mat: Quality Laundry and Books,P3087a,1993-05-29,Life Without Fear,25,7.00,psychology
4,Doc-U-Mat: Quality Laundry and Books,P3087a,1993-05-29,Prolonged Data Deprivation: Four Case Studies,15,19.99,psychology
5,Doc-U-Mat: Quality Laundry and Books,P3087a,1993-05-29,Emotional Security: A New Algorithm,25,7.99,psychology
0,News & Brews,P2121,1992-06-15,"Onions, Leeks, and Garlic: Cooking Secrets of ...",40,20.95,trad_cook
1,News & Brews,P2121,1992-06-15,Fifty Years in Buckingham Palace Kitchens,20,11.95,trad_cook
2,News & Brews,P2121,1992-06-15,"Sushi, Anyone?",20,14.99,trad_cook